export const commentary = {
  A: [
    `칭찬하는 말이나 감사의 말, 그 사람을 인정해주고 존중해주는 말이 이 사람들에겐 큰 힘을 주고 행복감을 느끼게 합니다. 이런 타입과 의사소통을 할 경우에는 상대를 격려하고 긍정해 주며 감사하며 공감해야 합니다. 이런 표현을 상대에게 진실하고 자주 해줘야 합니다. 모든 사람이 자신을 인정해 주는 말을 좋아하지만 이런 유형은 특히 상대의 상처 주는 말에 더 크게 상처를 입고 상심할 수 있습니다.`,
    `칭찬, 감사의 표현, 상대를 인정하고 높이는 말이 이 유형에겐 큰 힘이 됩니다. 짧고 간단한 말로 표현을 해도 효과적입니다. '쓰레기를 꺼내줘서 고맙다', '저녁을 만들어 줘서 고맙다', '오늘 머리 스타일 너무 좋다', '빨래를 접어서 고마웠다' 등의 예가 있습니다. 친절한 말은 이런 유형의 사람에게 큰 의미가 있습니다. 반대로 배우자에게 절대 해서는 안 되는 모욕적인 발언이나 부정적인 발언은 이런 유형의 사람에게 상처를 줄 수 있으며, 다른 유형의 사람보다 용서하는 데 더 오랜 시간이 걸릴 수도 있다는 것도 명심해야 합니다.  항상 배우자의 장점을 찾아 그 장점이 얼마나 훌륭한 지 말해주는 게 좋습니다. 아마 배우자는 칭찬하면 아마 그 칭찬에 맞추어 살려고 노력할 것입니다.`,
  ],
  B: [
    `배우자가 자신에게 집중하여 서로 같이 있는 시간이 많아야 사랑과 행복감을 느끼는 유형입니다. 단순하게 같이 시간을 공유하는 것이 아니라 같이 활동하는 속에서 온전히 나에게 관심을 가지고 집중해 주는 것을 원합니다.`,
    `이런 유형의 사람들은 대화 속에서 조언을 듣기보다 자신의 감정과 상황을 공감받기를 원합니다. 진정한 대화는 경청이 중요합니다. 부부생활은 문제를 해결하기보다 함께 살아가는 과정이 중요합니다. 진정한 대화는 서로 감정을 인정받고 공유할 때 가능합니다. 함께 영화구경을 한 후 외식을 하고 서로의 취미를 나누고, 상대의 눈을 마주하면서 이야기를 잘 들어주면 이런 유형의 사람들은 만족감을 느낍니다. 6개월 내에 부부 단둘이만 주말 나들이 계획을 세우는 것도 하나의 방법입니다. 일이나 자녀들의 방해를 받지 않는 주말을 택하는 것이 좋습니다. 둘 혹은 한 사람이 좋아하는 일을 함께하면서 편히 쉬는 데 집중하는 시간을 가져보는 것도 좋습니다.`,
  ],
  C: [
    `이 유형의 사람들은 선물 받는 것을 좋아합니다. 선물이 사랑의 상징이자 사랑을 표현하는 수단이라고 생각합니다. 세 번재 유형 “선물”은 선물하는 사람의 사려깊음과 선물 뒤에 숨은 노력을 통해 사랑을 확인합니다. 내가 전하는 애정이 담긴 쪽지 하나도 이 사람들에겐 영원히 간직하고픈 사랑의 징표입니다.`,
    `힘든 하루를 보낸 후에 그가 가장 좋아하는 아이스크림이나 그녀가 평소에 언급하던 악세서리를 주는 것도 한 방법입니다. 이런 행동은 당신의 파트너에게 그들의 얼굴에 웃음을 가져다 줄 무언가를 얻기 위해 최선을 다했다고 사랑을 표현하는 방식입니다. 상대에게 맘에 드는 선물을 고르는 것은 내가 상대를 항상 생각하고 또 사랑을 표현하기 위해 노력한다는 것을 보여줍니다. 선물을 주는 것은 이런 유형에게는 사랑을 지속시키는데 도움을 줍니다. 파트너가 특별한 경우든 아니든 간에 말해오던 선물을 고민해 보세요. 선물할 대에도 특별한 방법으로 주면 더 효과적입니다. 문화나 시대를 초월하여 선물의 상징성은 매우 중요합니다. 선물은 순간이지만 그 느낌은 영원합니다. 마음이 중요하다고 생각만하고 물질적 교환이 없으면 나중에 정신, 마음까지 멀어질 수도 있습니다. 선물은 가격에 상관없이 정성과 마음이 깃든 것이면 무엇이든지 의미있고 상대의 맘에 들면 더더욱 좋습니다.`,
  ],
  D: [
    `행동을 말보다 더 중요하게 생각하는 사람입니다.  이런 유형은 상대가 자신을 위해 도와줄 때 가장 행복감을 느낍니다. 내가 말하기 전에 상대가 나를 위해 알아서 척척해 해 주기를 원합니다.`,
    `아침에 창문을 열어 환기를 시키고, 빨래를 하고, 식사를 요리하거나, 설거지 등 자신을 위해 봉사해주면 이런 유형은 행복감을 느낄 것입니다. 하지만 의무적이거나 억지로 하는 봉사는 해당이 되지 않습니다. 부부 사이라면 청소하고 요리하는 등 집안 일을 주도적으로 생각하고 계획하고 시간을 내는 등 자발적으로 이런 일을 하면 매우 효과적인 사랑의 표현이 될 것입니다. 배우자가 잔소리처럼 늘 원하는 봉사가 있는지 잘 살펴보아야 합니다. 그런 요구는 이 유형의 사람에게 대단히 중요한 문제이기 때문입니다. 사랑의 표현으로 이런 요구를 들어준다면 1,000송이 빨간 장미꽃보다 훨씬 더 가치가 있을 것입니다.`,
  ],
  E: [
    `스킨십이 사랑의 언어인 사람들은 비언어적인 신체접촉, 키스, 포옹을 통해서 행복감을 느낍니다. 이런 유형의 사람들은 힘들 때 누군가 손을 잡아 주거나 어깨를 한번 두드려주는 것만으로도 아주 큰 힘을 얻습니다.`,
    `배우자가 손을 잡아주고 머리를 쓰다듬고 사랑을 듬뿍 담아 안아준다면 "난 혼자가 아니야", "행복하다"란 사랑의 감정을 느끼게 될 것입니다. 반대로 이런 사랑의 접촉을 소홀히 한다면 “스킨쉽”유형의 사람은 큰 상실감을 느낄 것입니다.  차에서 내려 주차장에서 마트로 들어갈 때 배우자의 손을 잡아 주거나, 저녁에 어깨를 주물러주고 배우자가 직장에서 집에 돌아올 때, 평상시보다 한걸음 빨리 반갑게 맞이하면서 평소와 다른 방식으로 작은 스킨쉽을 하는 것도 사랑을 돈독하게 하는 좋은 방법입니다.`,
  ],
};
